chore: sync state
